In [1]:
#기술통계량 탐색

## 학습목표
 - 데이터 분석을 위한 기술통계량 탐색
 - 실데티어를 활용하여 기술통계량 확인

In [3]:
import pandas as pd
a= pd.read_csv(r'C:\Users\jyc68\LG_DX_school_code\data\hr-info.csv',encoding='euc-kr',index_col='EID')

In [32]:
# 정보확인
a

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
EID,,,,,,,,,,,,,,,,,,,
E00206,시이오,M,NaN,P001,49,25,박사 학위,4.50,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y
E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y
E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.60,9100,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y
E00190,판라다,F,ORG007,P004,47,18,박사 학위,3.51,8500,2024-03-01,96,"Java, Data Analysis, Salesforce",Y,2006-03-01,NaN,NaN,NaN,KOREA,Y
E00209,누훈봉,M,ORG023,P004,47,19,박사 학위,3.38,8600,2023-03-01,66,"Java, Salesforce",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
E00322,부탐회,F,ORG014,P009,23,0,학사 학위,0.00,4500,NaN,4,Java,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00389,초두반,F,ORG012,P009,23,0,학사 학위,0.00,4500,NaN,4,"Salesforce, Java",Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00438,권개득,M,ORG024,P009,23,0,학사 학위,0.00,4500,NaN,4,Python,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00304,탐출조,M,ORG009,P009,24,0,학사 학위,0.00,4500,NaN,4,Salesforce,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00428,을충나,F,ORG003,P009,24,0,학사 학위,0.00,4500,NaN,4,"Data Analysis, Python, Marketing",Y,2024-09-01,NaN,NaN,NaN,KOREA,N

In [11]:
# 기술 통계량 확인 -> 기본 수치데이터에서 확인할 수 있다!
a.describe().round()
# count : 데이터의 총 개수 -> 결측치(Nan)를 제외한 결과
# mean : 평균
# std: 표준편자 -> 데이터의 분포 / 0에 가까울수록 밀집
# min : 최소값 , max : 최대값
# 25%, 50%, 75% : 사분위수 -> 데이터의 분포 (전체 데이터의 1/4 지점, 2/4 지점, 3/4 지점)
# 50% (중위수) -> 전체데이터에서 가운데 위치 값
# 데이터를 대표하는 대표값: 평균, 중위수, 최빈값

         AGE  SERVICE_YEAR  PERFORMANCE_SCORE   SALARY  TRAINING_HOURS
count  200.0         200.0              200.0    200.0           200.0
mean    32.0           5.0                2.0   5987.0            35.0
std      7.0           6.0                2.0   1183.0            40.0
min     22.0           0.0                0.0   4500.0             0.0
25%     27.0           0.0                0.0   5000.0             4.0
50%     30.0           1.0                2.0   5600.0            21.0
75%     37.0           8.0                3.0   6825.0            57.0
max     49.0          25.0                5.0  10200.0           240.0

In [12]:
a.describe(include=['object'])

,ENAME,GENDER,ORG_CD,POS_CD,EDU_LEVEL,LAST_PROMO_DT,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
count,200,200,197,200,200,182,200,200,200,49,49,49,200,200
unique,200,2,30,9,5,4,91,2,16,8,6,2,6,2
top,시이오,M,ORG021,P008,학사 학위,2024-03-01,Salesforce,Y,2024-03-01,2024-03-01,이직,N,KOREA,Y
freq,1,117,12,55,159,111,24,151,64,19,28,45,102,150

### 통계값 개별 확인
    - 총합,평균,개수,중복값

In [14]:
#sum() 총합
a['SALARY'].sum()

np.int64(1197400)

In [15]:
#mean() 평균
a['SALARY'].mean()

np.float64(5987.0)

- 데이터의 개수
 - count()
 - value_counts()

In [16]:
# count 데이터의 수 -> 결측치 제외한 개수 
a['RETIRE_DATE'].count()

np.int64(49)

In [17]:
#value_counts(): 컬럼에 있는 unique한 값들을 기준으로 개수를 세주는 함수 
a['GENDER'].value_counts()

GENDER
M    117
F     83
Name: count, dtype: int64

In [28]:
# 전체 직원의 남자 비율 확ㅇ니
b=(a['GENDER'].value_counts()['M'])/a['GENDER'].count()
b*100

np.float64(58.5)

- unique()

In [29]:
#국적 확인
a['NATION'].unique()

array(['KOREA', 'Japan', 'USA', 'India', 'China', 'UK'], dtype=object)

In [31]:
#국적별 직원의 수 
a['NATION'].value_counts()

NATION
KOREA    102
USA       22
India     22
Japan     21
UK        18
China     15
Name: count, dtype: int64

-min(),max()

In [37]:
#직원에 최대 근속연수 최소 근속연수
print(a['SERVICE_YEAR'].max())
print(a['SERVICE_YEAR'].min())

25
0

In [38]:
# 나이의 중앙값 
a['AGE'].median()

30.0

#### 간단 실습 
- 교육수준의 따른 평균연봉

In [40]:
b=a["EDU_LEVEL"].unique()
b

array(['박사 학위', '학사 학위', '석사 학위', '고등학교 졸업', '전문대 학위'], dtype=object)

In [47]:
a[a["EDU_LEVEL"]=='박사 학위']['SALARY']

EID
E00206    10200
E00181     9500
E00164     9100
E00190     8500
E00209     8600
E00294     8600
E00411     8500
E00210     7600
E00258     7500
E00423     7100
E00221     7000
E00480     5800
Name: SALARY, dtype: int64

In [49]:
a[a["EDU_LEVEL"]=='박사 학위']['SALARY'].mean()

np.float64(8166.666666666667)

In [59]:
for i in b:
    tmp=0
    tmp=(a[a["EDU_LEVEL"]==i]['SALARY'].mean()).round(2)
    print(f"{i} : {tmp}")

박사 학위 : 8166.67
학사 학위 : 5727.04
석사 학위 : 6900.0
고등학교 졸업 : 6140.0
전문대 학위 : 5050.0

In [64]:
a[["EDU_LEVEL",'SALARY']].groupby('EDU_LEVEL')['SALARY'].mean().round(2)

EDU_LEVEL
고등학교 졸업    6140.00
박사 학위      8166.67
석사 학위      6900.00
전문대 학위     5050.00
학사 학위      5727.04
Name: SALARY, dtype: float64

In [71]:
data=a[["EDU_LEVEL",'SALARY','GENDER']].groupby(['EDU_LEVEL','GENDER'])['SALARY'].mean().round(2)

In [72]:
data

EDU_LEVEL  GENDER
고등학교 졸업    F         6200.00
           M         6100.00
박사 학위      F         8425.00
           M         8037.50
석사 학위      F         7233.33
           M         6525.00
전문대 학위     F         5600.00
           M         4500.00
학사 학위      F         5643.08
           M         5785.11
Name: SALARY, dtype: float64

In [74]:
#성별에 따른 평균연봉
data=a[['SALARY','GENDER']].groupby('GENDER')['SALARY'].mean().round(2)
data

GENDER
F    5975.90
M    5994.87
Name: SALARY, dtype: float64